# -*- coding: utf-8 -*-
from pprint import pprint

from bgnlp import extract_keywords


# Here you may paste a text in Bulgarian for which you want to extract keywords.
text = """
Френският президент Еманюел Макрон, който се очаква тази седмица да участва в срещата на върха на Г-7 в Япония, след това ще направи спирка в Монголия в неделя за кратко посещение, предаде Франс прес. Агенцията отбелязва, че това ще е първа подобна визита на френски президент в тази страна без излаз на море, разположена между Китай и Русия, към която Западът проявява нарастващ интерес.

Макрон ще участва от петък до неделя в срещи с лидерите на Япония, САЩ, Канада, Германия, Великобритания и Италия в японския град Хирошима.

В неделя, след заключителната си пресконференция, той ще замине за Улан Батор за вечеря с монголския президент Ухнаагийн Хурелсух, съобщи Елисейския дворец.

Макрон ще посети и Музея на Чингис Хан, великия монголски завоевател от 13 век. Музеят ще изпрати част от колекцията си на Историческия музей във френския град Нант за изложба, планирана за октомври. Френският президент ще замине за Париж късно вечерта в неделя.

„Фактът, че Монголия е на пътя ни обратно за Франция, ни позволява да направим тази първа историческа визита, като ѝ придадем много специално значение“, обясниха служители от антуража на Макрон, пише БТА.
"""

keywords = extract_keywords(text, threshold=0.5)
print("Keywords:")
pprint(keywords)
# Which prints:
# Keywords:
# [{'keyword': 'Еманюел Макрон', 'score': 0.8759163320064545},
#  {'keyword': 'Г-7', 'score': 0.5938143730163574},
#  {'keyword': 'Япония', 'score': 0.607077419757843}]
