POS2IDX = {
	'българско географско понятие': 0,
	'българско населено място': 1,
	'въпросително местоимение': 2,
	'глагол': 3,
	'държава': 4,
	'лично име': 5,
	'лично местоимение': 6,
	'междуметие': 7,
	'месец': 8,
	'наречие': 9,
	'неопределително местоимение': 10,
	'обобщително местоимение': 11,
	'относително местоимение': 12,
	'отрицателно местоимение': 13,
	'показателно местоимение': 14,
	'предлог': 15,
	'прилагателно име': 16,
	'притежателно местоимение': 17,
	'световноизвестен град': 18,
	'световноизвестно географско понятие': 19,
	'столица': 20,
	'съществително име': 21,
	'съюз': 22,
	'търговска марка': 23,
	'фамилно име или презиме': 24,
	'частица': 25,
	'числително бройно име': 26,
	'числително редно име': 27
}
IDX2POS = {idx: pos for pos, idx in POS2IDX.items()}


def create_actions_pipeline(action_list):

    def registry(func):
        action_list.append(func)
        return func

    return registry
